In [1]:
%%bash
if [ ! -f ./train.csv ]; then
    kaggle competitions download -c titanic
    unzip titanic.zip
fi

In [4]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [5]:
train_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")
print(train_df.shape)
train_df.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train_df["Survived"].mean()

0.3838383838383838

In [7]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
from sklearn import preprocessing

In [10]:
onehot = preprocessing.OneHotEncoder(drop="first")
le = preprocessing.LabelEncoder()

In [11]:
drop_cols = ["Name", "Age", "Ticket", "Cabin", "Embarked", "PassengerId"]
train_df.drop(drop_cols, axis=1, inplace=True)
test_df.drop(drop_cols, axis=1, inplace=True)

In [12]:
train_df.head()

   Survived  Pclass     Sex  SibSp  Parch     Fare
0         0       3    male      1      0   7.2500
1         1       1  female      1      0  71.2833
2         1       3  female      0      0   7.9250
3         1       1  female      1      0  53.1000
4         0       3    male      0      0   8.0500

In [13]:
onehot.categories_

AttributeError: 'OneHotEncoder' object has no attribute 'categories_'

In [14]:
onehot_vals = onehot.fit_transform(train_df["Pclass"].values[:,None]).todense()
class_names = onehot.categories_[0][1:]
pclass = pd.DataFrame(onehot_vals, columns=class_names)
train_df.drop("Pclass", axis=1, inplace=True)
train_df = pd.concat([train_df, pclass], axis=1)

onehot_vals = onehot.transform(test_df["Pclass"].values[:, None]).todense()
pclass = pd.DataFrame(onehot_vals, columns=class_names)
test_df.drop("Pclass", axis=1, inplace=True)
test_df = pd.concat([test_df, pclass], axis=1)

In [15]:
train_df.head()

   Survived     Sex  SibSp  Parch     Fare    2    3
0         0    male      1      0   7.2500  0.0  1.0
1         1  female      1      0  71.2833  0.0  0.0
2         1  female      0      0   7.9250  0.0  1.0
3         1  female      1      0  53.1000  0.0  0.0
4         0    male      0      0   8.0500  0.0  1.0